In [266]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [267]:
s= pd.Series([1,3,5,np.nan,6,9])

In [268]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [269]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [270]:
df

                   A         B         C         D
2013-01-01  1.173129  0.123229 -0.344216 -1.196202
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876
2013-01-03  0.618461 -0.324518  0.154471 -1.431397
2013-01-04 -0.698922 -0.350612  1.099087  0.147182
2013-01-05  0.804665  0.625682  0.098050 -1.272878
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128

In [271]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [272]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [273]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [274]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.804665  0.625682  0.098050 -1.272878
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128

In [275]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [276]:
df.to_numpy()

array([[ 1.17312881,  0.12322919, -0.3442161 , -1.19620235],
       [-2.00682742,  0.1956863 , -1.0515854 , -0.11787595],
       [ 0.61846113, -0.32451781,  0.15447062, -1.43139687],
       [-0.69892215, -0.35061188,  1.09908689,  0.14718178],
       [ 0.80466542,  0.62568232,  0.09805049, -1.27287839],
       [-0.01527518, -0.25323609, -0.13635373, -1.25312752]])

In [277]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [278]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.173129   -2.006827    0.618461   -0.698922    0.804665   -0.015275
B    0.123229    0.195686   -0.324518   -0.350612    0.625682   -0.253236
C   -0.344216   -1.051585    0.154471    1.099087    0.098050   -0.136354
D   -1.196202   -0.117876   -1.431397    0.147182   -1.272878   -1.253128

In [279]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.698922 -0.350612  1.099087  0.147182
2013-01-03  0.618461 -0.324518  0.154471 -1.431397
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128
2013-01-01  1.173129  0.123229 -0.344216 -1.196202
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876
2013-01-05  0.804665  0.625682  0.098050 -1.272878

In [280]:
df["A"]

2013-01-01    1.173129
2013-01-02   -2.006827
2013-01-03    0.618461
2013-01-04   -0.698922
2013-01-05    0.804665
2013-01-06   -0.015275
Freq: D, Name: A, dtype: float64

In [281]:
df[0:1]

                   A         B         C         D
2013-01-01  1.173129  0.123229 -0.344216 -1.196202

In [282]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  1.173129  0.123229
2013-01-02 -2.006827  0.195686
2013-01-03  0.618461 -0.324518
2013-01-04 -0.698922 -0.350612
2013-01-05  0.804665  0.625682
2013-01-06 -0.015275 -0.253236

In [283]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [284]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [285]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01  1.173129  0.123229 -0.344216 -1.196202
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876
2013-01-03  0.618461 -0.324518  0.154471 -1.431397
2013-01-04 -0.698922 -0.350612  1.099087  0.147182
2013-01-05  0.804665  0.625682  0.098050 -1.272878
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128

Selection by Location of Label

In [286]:
df.loc[dates[0],"A"]

np.float64(1.1731288088990008)

In [287]:
df.at[dates[0],"A"]

np.float64(1.1731288088990008)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [288]:
df.iloc[3]

A   -0.698922
B   -0.350612
C    1.099087
D    0.147182
Name: 2013-01-04 00:00:00, dtype: float64

In [289]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.698922 -0.350612
2013-01-05  0.804665  0.625682

In [290]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -2.006827 -1.051585
2013-01-03  0.618461  0.154471
2013-01-05  0.804665  0.098050

In [291]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876
2013-01-03  0.618461 -0.324518  0.154471 -1.431397

In [292]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.123229 -0.344216
2013-01-02  0.195686 -1.051585
2013-01-03 -0.324518  0.154471
2013-01-04 -0.350612  1.099087
2013-01-05  0.625682  0.098050
2013-01-06 -0.253236 -0.136354

In [293]:
df.iloc[1,1]

np.float64(0.19568630399124903)

In [294]:
df

                   A         B         C         D
2013-01-01  1.173129  0.123229 -0.344216 -1.196202
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876
2013-01-03  0.618461 -0.324518  0.154471 -1.431397
2013-01-04 -0.698922 -0.350612  1.099087  0.147182
2013-01-05  0.804665  0.625682  0.098050 -1.272878
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128

Boolean Indexing

In [295]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  1.173129  0.123229 -0.344216 -1.196202
2013-01-03  0.618461 -0.324518  0.154471 -1.431397
2013-01-05  0.804665  0.625682  0.098050 -1.272878

In [296]:
df[df>0]

                   A         B         C         D
2013-01-01  1.173129  0.123229       NaN       NaN
2013-01-02       NaN  0.195686       NaN       NaN
2013-01-03  0.618461       NaN  0.154471       NaN
2013-01-04       NaN       NaN  1.099087  0.147182
2013-01-05  0.804665  0.625682  0.098050       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [297]:
df2 = df.copy()

In [298]:
df2["E"] = ["one","one","two","three","four","three"]

In [299]:
df2

                   A         B         C         D      E
2013-01-01  1.173129  0.123229 -0.344216 -1.196202    one
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876    one
2013-01-03  0.618461 -0.324518  0.154471 -1.431397    two
2013-01-04 -0.698922 -0.350612  1.099087  0.147182  three
2013-01-05  0.804665  0.625682  0.098050 -1.272878   four
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128  three

Setting

In [300]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [301]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [302]:
df["F"]=s1

In [303]:
df.at[dates[0],"A"]=0

In [304]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [305]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.344216 -1.196202  NaN
2013-01-02 -2.006827  0.195686 -1.051585 -0.117876  1.0
2013-01-03  0.618461 -0.324518  0.154471 -1.431397  2.0
2013-01-04 -0.698922 -0.350612  1.099087  0.147182  3.0
2013-01-05  0.804665  0.625682  0.098050 -1.272878  4.0
2013-01-06 -0.015275 -0.253236 -0.136354 -1.253128  5.0

In [306]:
df.loc[:,"D"]=np.array([5]*len(df))

In [307]:
len(df)

6

In [308]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0
2013-01-05  0.804665  0.625682  0.098050  5.0  4.0
2013-01-06 -0.015275 -0.253236 -0.136354  5.0  5.0

In [309]:
df2 = df.copy()

In [310]:
df2[df2>0]= -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.344216 -5.0  NaN
2013-01-02 -2.006827 -0.195686 -1.051585 -5.0 -1.0
2013-01-03 -0.618461 -0.324518 -0.154471 -5.0 -2.0
2013-01-04 -0.698922 -0.350612 -1.099087 -5.0 -3.0
2013-01-05 -0.804665 -0.625682 -0.098050 -5.0 -4.0
2013-01-06 -0.015275 -0.253236 -0.136354 -5.0 -5.0

Missing Data

In [311]:
df1 = df.reindex(index=dates[0:4], columns =list(df.columns)+["E"])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN NaN
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0 NaN
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0 NaN
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0 NaN

In [312]:
df1.loc[dates[0]: dates[1],"E"]=1

In [313]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN  1.0
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0  NaN
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0  NaN

Drop Missing Values

In [314]:
df1.dropna(how="any", axis=1)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN  1.0
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0  NaN
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0  NaN

In [315]:
p=df1.dropna(how="all", axis=1)

In [316]:
p

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN  1.0
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0  NaN
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0  NaN

In [317]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0
2013-01-05  0.804665  0.625682  0.098050  5.0  4.0
2013-01-06 -0.015275 -0.253236 -0.136354  5.0  5.0

In [318]:
df3 = df.copy()

In [319]:
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0
2013-01-05  0.804665  0.625682  0.098050  5.0  4.0
2013-01-06 -0.015275 -0.253236 -0.136354  5.0  5.0

While using df.dropna function ,,, axis= 0 to remove row , 1 to remove column ... how="any" removes row/column if there is any missing value in the row/column .............. how = "all" removes the row./column only if all the value in the row or column are NaN

In [320]:
df5 = df3.dropna(axis=1, how="any")
df5

                   A         B         C    D
2013-01-01  0.000000  0.000000 -0.344216  5.0
2013-01-02 -2.006827  0.195686 -1.051585  5.0
2013-01-03  0.618461 -0.324518  0.154471  5.0
2013-01-04 -0.698922 -0.350612  1.099087  5.0
2013-01-05  0.804665  0.625682  0.098050  5.0
2013-01-06 -0.015275 -0.253236 -0.136354  5.0

Operations

In [321]:
df.rename(columns={"F":"E"},inplace=True)
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0
2013-01-05  0.804665  0.625682  0.098050  5.0  4.0
2013-01-06 -0.015275 -0.253236 -0.136354  5.0  5.0

In [322]:
df.mean()

A   -0.216316
B   -0.017833
C   -0.030091
D    5.000000
E    3.000000
dtype: float64

In [323]:
df.mean(axis=0)

A   -0.216316
B   -0.017833
C   -0.030091
D    5.000000
E    3.000000
dtype: float64

In [324]:
df.mean(axis=1)

2013-01-01    1.163946
2013-01-02    0.627455
2013-01-03    1.489683
2013-01-04    1.609911
2013-01-05    2.105680
2013-01-06    1.919027
Freq: D, dtype: float64

In [325]:
s= pd.Series([1,2,5,np.nan,6,8],index=dates).shift(2)

In [326]:
df,s

(                   A         B         C    D    E
 2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN
 2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0
 2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0
 2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0
 2013-01-05  0.804665  0.625682  0.098050  5.0  4.0
 2013-01-06 -0.015275 -0.253236 -0.136354  5.0  5.0,
 2013-01-01    NaN
 2013-01-02    NaN
 2013-01-03    1.0
 2013-01-04    2.0
 2013-01-05    5.0
 2013-01-06    NaN
 Freq: D, dtype: float64)

In [327]:
df.sub(s,axis="index")

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.381539 -1.324518 -0.845529  4.0  1.0
2013-01-04 -2.698922 -2.350612 -0.900913  3.0  1.0
2013-01-05 -4.195335 -4.374318 -4.901950  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

User Defined Functions

.agg() is used to perform a column wise operation in the dataframe,, where each column as pandas series is operated.. to operate in row, we can use axis=1

In [328]:
df.agg(lambda x: np.mean(x)*2)

A    -0.432633
B    -0.035666
C    -0.060182
D    10.000000
E     6.000000
dtype: float64

In [329]:
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.344216  5.0  NaN
2013-01-02 -2.006827  0.195686 -1.051585  5.0  1.0
2013-01-03  0.618461 -0.324518  0.154471  5.0  2.0
2013-01-04 -0.698922 -0.350612  1.099087  5.0  3.0
2013-01-05  0.804665  0.625682  0.098050  5.0  4.0
2013-01-06 -0.015275 -0.253236 -0.136354  5.0  5.0

df.transform() applies a function to each element preserving the shape of the dataframe

In [330]:
df.transform(lambda x:x*100)

                     A          B           C      D      E
2013-01-01    0.000000   0.000000  -34.421610  500.0    NaN
2013-01-02 -200.682742  19.568630 -105.158540  500.0  100.0
2013-01-03   61.846113 -32.451781   15.447062  500.0  200.0
2013-01-04  -69.892215 -35.061188  109.908689  500.0  300.0
2013-01-05   80.466542  62.568232    9.805049  500.0  400.0
2013-01-06   -1.527518 -25.323609  -13.635373  500.0  500.0

Value Counts

In [331]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    0
1    2
2    3
3    4
4    4
5    1
6    0
7    0
8    0
9    3
dtype: int32

In [332]:
s.value_counts()

0    4
3    2
4    2
2    1
1    1
Name: count, dtype: int64

String Methods

In [333]:
s=pd.Series(["A","B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])

In [334]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [335]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [336]:
df = pd.DataFrame(np.random.randn(10,4))

In [337]:
df

          0         1         2         3
0  1.181873  0.618474  0.436025  1.391083
1 -0.278067 -1.153911  1.023664 -0.089172
2 -0.212854  0.519514 -0.125276  0.059813
3  1.380959 -0.834397 -1.122435 -0.123585
4 -0.832114  1.122715  0.255357 -0.882166
5 -0.229661 -0.775223 -1.415105  1.512250
6  0.193035  1.056401 -1.296062 -2.615380
7 -1.625898 -0.292232  0.717125  0.351384
8 -0.557337 -0.312899  0.471099  0.925739
9 -0.445461  0.387307 -1.229089  0.117353

Breaking into Pieces

In [339]:
pieces = [df[:3],df[3:7],df[7:]]

In [340]:
pieces

[          0         1         2         3
 0  1.181873  0.618474  0.436025  1.391083
 1 -0.278067 -1.153911  1.023664 -0.089172
 2 -0.212854  0.519514 -0.125276  0.059813,
           0         1         2         3
 3  1.380959 -0.834397 -1.122435 -0.123585
 4 -0.832114  1.122715  0.255357 -0.882166
 5 -0.229661 -0.775223 -1.415105  1.512250
 6  0.193035  1.056401 -1.296062 -2.615380,
           0         1         2         3
 7 -1.625898 -0.292232  0.717125  0.351384
 8 -0.557337 -0.312899  0.471099  0.925739
 9 -0.445461  0.387307 -1.229089  0.117353]

In [341]:
pd.concat(pieces)

          0         1         2         3
0  1.181873  0.618474  0.436025  1.391083
1 -0.278067 -1.153911  1.023664 -0.089172
2 -0.212854  0.519514 -0.125276  0.059813
3  1.380959 -0.834397 -1.122435 -0.123585
4 -0.832114  1.122715  0.255357 -0.882166
5 -0.229661 -0.775223 -1.415105  1.512250
6  0.193035  1.056401 -1.296062 -2.615380
7 -1.625898 -0.292232  0.717125  0.351384
8 -0.557337 -0.312899  0.471099  0.925739
9 -0.445461  0.387307 -1.229089  0.117353

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=records%20to%20it.-,Join,-%23

Join

In [343]:
left = pd.DataFrame({"key":["foo","foo"],"Ival":[1,2]})
left

   key  Ival
0  foo     1
1  foo     2

In [345]:
right = pd.DataFrame({"key":["foo","foo"],"rval":[4,5]})
right

   key  rval
0  foo     4
1  foo     5

In [346]:
pd.merge(left,right,on="key")

   key  Ival  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [347]:
left = pd.DataFrame({"key":["foo","zoo"],"Ival":[1,2]})
right = pd.DataFrame({"key":["foo","zoo"],"Jval":[4,5]})
pd.merge(left,right,on="key")

   key  Ival  Jval
0  foo     1     4
1  zoo     2     5

Grouping

In [348]:
df = pd.DataFrame(
    {
        "A":["foo","bar","foo","bar","foo","bar","foo","bar"],
        "B":["one","one","two","three","two","two","one","one"],
        "C":np.random.randn(8),
        "D":np.random.randn(8)
    }
)

In [349]:
df

     A      B         C         D
0  foo    one  0.622764  1.278787
1  bar    one -0.587357 -0.971041
2  foo    two -2.378715  0.480572
3  bar  three -0.034884  1.004286
4  foo    two -0.404925 -0.004195
5  bar    two  1.120506 -0.359985
6  foo    one  0.732389  0.265584
7  bar    one  1.982113  0.900597

[2082/05/07 09:55 PM](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=a%20column%20label%2C%20selecting)

In [352]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar  2.480378  0.573857
foo -1.428488  2.020747